specialties = ["Экономика",
               "Менеджмент",
               "Юриспруденция",
               "Лингвистика",
               "Медицина", "Биология",
               "Филология",
               "Информационные технологии",
               "Математика",
               "Машиностроение",
               "Робототехника",
               "Нефтегазовое дело",
               "Педагогическое образование (педагогика)",
               "Пищевые технологии", ""
                "Право",
               "Психология",
               "Социология",
               "Строительство",
               "Технологии легкой промышленности",
               "Технологии материалов",
               "Физика", "Химические технологии",
               "Химия", "Экология", "Экономика",
               "Энергетика",
               "Авиационная и ракетно-космическая техника",
               "Биотехнологии и биоинженерия",
               "География",
               "Геология",
               "История и археология",
               "Лингвистика и иностранные языки",
                "Архитектура",
               "Дизайн",
               "Журналистика",
               "Изобразительное искусство",
               "Культурология", "Маркетинг",
               "Международные отношения",
               "Музыкальное искусство",
               "Политология",
               "Реклама и связи с общественностью",
               "Социальная работа", "Туризм",
               "Физическая культура и спорт",
               "Философия", "Хореография",
                "Актерское искусство",
               "Бухгалтерский учет и аудит",
               "Гостиничное дело",
               "Документоведение и архивоведение",
               "Землеустройство и кадастры",
               "Инженерная геодезия",
               "Кинематография", "Ландшафтная архитектура",
               "Международный бизнес",
               "Налоги и налогообложение",
               "Организация работы с молодежью",
               "Пожарная безопасность",
               "Реставрация",
               "Связи с общественностью и реклама в социально-культурной сфере",
               "Таможенное дело"
]

access_token = "eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJodHRwOi8vYW55LXNpdGUub3JnIiwiYXVkIjoiaHR0cDovL2FueS1zaXRlLm9yZyIsImlhdCI6MTY4MDI3NDQ3MCwibmJmIjoxNjgwMjc0NDcwLCJkYXRhIjp7ImlkIjpudWxsLCJsYXN0bmFtZSI6bnVsbCwiZW1haWwiOiJtaGx2dmxuQGdtYWlsLmNvbSIsImFkbWluIjpmYWxzZX19.Tl5bE3uSkLjCJiJCsYb_X5pbXvKBkQoPc_lerVyEROw"
import requests

print(len(specialties))
for i in specialties:
    if len(i) > 40:
        string = i.split()
        abbr = ""
        for s in string:
            abbr+=s[0].upper()
        i = abbr
    print(requests.get("http://agency/api/specialities.add",
            params=[('access_token', access_token), ('name', i)]))
